package homework.five.two;

/**
 1. Створіть тип даних Учасник та кілька його реалізацій: Людина, Кіт, Робот.
 2. Класи з п.2 повинні мати поведінку бігати і стрибати (методи просто виводять інформацію про дію в консоль).
 3. Створіть тип даних Перешкода та кілька її реалізацій: Бігова Доріжка та Стіна.
 4. Класи з п.3 повинні мати поведінку подолати перешкоду (overcome).
 5. Налагодити взаємодію між Учасником та Перешкодою.
 Іншими словами, учасники під час проходження через перешкоди мають виконувати відповідні дії (бігти чи стрибати).
 Наприклад: Людина пробігла бігову доріжку.*/
public interface Member {
    void run();
    void jump();
    void overcome(Obstacle obstacle);

}
